[{ "newsId": 5718137557, "url": "http://asbarez.com/168240/us-senators-urge-trump-to-demand-erdogan-respect-human-rights/", "summary": "WASHINGTON ­– On Wednesday, U.S.\nSenators John McCain (R-AZ), Chairman of the Senate Armed Services Committee, and Bob Menendez (D-NJ), member of the Senate Foreign Relations Committee, led a bipartisan letter to President Trump today calling on the administration to urge Turkish President Tayyip Erdogan to stop harassing American diplomats, to respect human rights, and to uphold democratic values in Turkey.\nCiting several recent actions including the arbitrary arrest of several U.S. Consulate employees in Istanbul, the detention of top Amnesty International officials, the sentencing by a Turkish court of Wall Street Journal reporter Ayla Albayrak, and the brutal attack by Turkish security personnel of peaceful demonstrators protesting Erdogan’s visit to Washington, D.C., the senators urged President Trump to demand the Erdogan government respect human rights and the rule of law.\n“Erdogan and his allies have corroded Turkey’s democracy by mounting an assault on the rule of law, using sweeping state of emergency authorities to stifle fundamental rights including free speech, undermining the independence of the judiciary, and quashing any expressions of opposition,” wrote the senators.\nThe letter could be read here.", "author": [  ], "src": "http://asbarez.com/", "title": "US Senators Urge Trump To Demand Erdogan Respect Human Rights", "keywords": [ "washington", "trump", "senators", "turkish", "rights", "president", "erdogan", "john", "demand", "human", "rule", "urge", "letter", "respect" ], "publish_date": "2017-10-27 12:11:06+00:00", "news": "WASHINGTON ­– On Wednesday, U.S. Senators John McCain (R-AZ), Chairman of the Senate Armed Services Committee, and Bob Menendez (D-NJ), member of the Senate Foreign Relations Committee, led a bipartisan letter to President Trump today calling on the administration to urge Turkish President Tayyip Erdogan to stop harassing American diplomats, to respect human rights, and to uphold democratic values in Turkey.\n\nCiting several recent actions including the arbitrary arrest of several U.S. Consulate employees in Istanbul, the detention of top Amnesty International officials, the sentencing by a Turkish court of Wall Street Journal reporter Ayla Albayrak, and the brutal attack by Turkish security personnel of peaceful demonstrators protesting Erdogan’s visit to Washington, D.C., the senators urged President Trump to demand the Erdogan government respect human rights and the rule of law.\n\n“Erdogan and his allies have corroded Turkey’s democracy by mounting an assault on the rule of law, using sweeping state of emergency authorities to stifle fundamental rights including free speech, undermining the independence of the judiciary, and quashing any expressions of opposition,” wrote the senators. “We urge you to send a clear message to President Erdogan that the United States will not tolerate this type of behavior and that any cooperation must be based on a shared commitment to human rights and rule of law.”\n\nThe letter was co-signed by Senators Ben Cardin (D-MD), John Boozman (R-AR), Chris Van Hollen (D-MD), Marco Rubio (R-FL), Richard Durbin (D-IL), John Cornyn (R-TX), Chris Coons (D-DE), Martin Heinrich (R-NM), Edward Markey (D-MA), Tammy Baldwin (D-WI), Jeanne Shaheen (D-NH), and Bernard Sanders (I-VT).\n\nThe letter could be read here.", "collection_date": "Fri Oct 27 19:08:18 2017", "converted_collection_date": "10-27-2017 19:08:18" },
{ "newsId": 5718329204, "url": "http://www.chicoer.com/general-news/20171116/gop-pushes-tax-bill-toward-house-ok-senate-faces-problems", "summary": "While details of the House and Senate bills differ, many pass-through owners would owe more than 20 percent in taxes for much of their income.\nSenate Finance Committee Chairman Orrin Hatch, R-Utah, used the savings to make his bill’s personal tax reductions modestly more generous.\nAnother provision in the Senate plan would end the bill’s personal income tax cuts in 2026.\nA small group of House Republicans largely from New York and New Jersey rebelled because the House plan would erase tax deductions for state and local income and sales taxes and limit property tax deductions to $10,000.\nThe House measure would reduce and ultimately repeal the tax paid on the largest inheritances, while the Senate would limit that levy to fewer estates.", "author": [ "Alan Fram", "Marcy Gordon", "The Associated Press" ], "src": "http://www.chicoer.com/", "title": "GOP pushes tax bill toward House OK, Senate faces problems", "keywords": [ "pushes", "ok", "problems", "senate", "republicans", "tax", "gop", "deductions", "house", "plan", "bills", "faces", "bill", "measure", "personal", "republican" ], "news": "Sen. Ron Wyden, D-Ore., left, the top Democrat on the Senate Finance Committee, criticizes the Republican tax reform plan while Chairman Orrin Hatch, R-Utah, listens to his opening statement as the panel begins work overhauling the nation’s tax code, on Capitol Hill in Washington, Monday. The legislation in the House and Senate carries high political stakes for President Donald Trump and Republican leaders in Congress, who view passage of tax cuts as critical to the GOP’s success at the polls next year. J. Scott Applewhite — The Associated Press\n\nWASHINGTON >> Republicans drove a near $1.5 trillion tax overhaul toward House passage Thursday, even as Senate GOP dissenters emerged in a sign that party leaders had problems to resolve before Congress could give President Donald Trump his first legislative triumph.\n\nTrump was heading to the Capitol for a pep rally with House Republicans, shortly before the chamber was expected to approve the measure over solid Democratic opposition. There were just a handful of GOP opponents in the House, unhappy because the measure sharply curbs deductions for state and local taxes, but all agreed that passage seemed certain.\n\nLike a similar package nearing approval by the GOP-led Senate Finance Committee, most of the House measure’s reductions would go to business. Both bills would slash the 35 percent corporate tax rate to 20 percent and reduce levies on millions of partnerships and certain corporations, including many small businesses. Personal income tax rates for many would be reduced though some deductions and credits would be reduced or eliminated, but in the process projected federal deficits would grow by $1.5 trillion over the coming decade.\n\nAs the House debated its measure, Democrats called the measure a gift tilted disproportionately toward corporations and the wealthy that would leave millions of people actually paying higher taxes. Republicans said that average taxpayers across all income groups would get tax reductions.\n\nRep. Jeb Hensarling, R-Texas, said the GOP plan would create “a fairer, flatter, simpler, more compact” tax code that would boost the economy. He said that left Democrats relying on “the politics of division, envy and class warfare.”\n\n“We’ve seen this trickle-down medicine side show before,” said Rep. Lloyd Doggett, D-Texas. “It didn’t work then, it won’t work now. All they’re doing is grabbing for a political life preserver after 10 months of Republican failures.”\n\nEager to act before opposition groups could sow doubts among the rank-and-file, Republican leaders were anxious to hand Trump the first crowning achievement of his presidency by Christmas.\n\nBut on Wednesday, Sen. Ron Johnson of Wisconsin became the first Republican senator to say he opposes his party’s tax package, though he didn’t rule out coming on board if changes were made.\n\nAdvertisement\n\nJohnson complained the bills were more generous to publicly traded corporations than to so-called pass-through entities. Those are millions of partnerships and specially organized corporations whose owners pay levies using individual, not corporate, tax rates. While details of the House and Senate bills differ, many pass-through owners would owe more than 20 percent in taxes for much of their income.\n\nRepublicans controlling the Senate 52-48 can approve the legislation with just 50 votes, plus tie-breaking support from Vice President Mike Pence. With solid Democratic opposition likely, that means they can lose just two GOP votes.\n\nBesides Johnson, Republican Sens. Susan Collins of Maine, Jeff Flake and John McCain of Arizona, Bob Corker of Tennessee and Lisa Murkowski have yet to commit to backing the tax measure.\n\nCollins expressed concerns about a provision added to the Senate measure that would repeal President Barack Obama’s health law requirement that people buy coverage or pay a fine. The nonpartisan Congressional Budget Office has projected that would result in 13 million more uninsured people by 2027. She was also unhappy with the Senate bill’s elimination of all deductions for state and local taxes.\n\nRepealing the health law’s individual mandate would save $338 billion over the coming decade because fewer people would be pressured into getting government-paid coverage like Medicaid. Senate Finance Committee Chairman Orrin Hatch, R-Utah, used the savings to make his bill’s personal tax reductions modestly more generous.\n\nAnother provision in the Senate plan would end the bill’s personal income tax cuts in 2026.\n\nThat proposal, derided by Democrats as a gimmick, was designed to pare the bill’s long-term costs. Legislation cannot boost budget deficits after 10 years if it is to qualify for Senate procedures barring bill-killing filibusters. Those delays take 60 votes to block, numbers Republicans lack.\n\nThe Senate Finance panel was on track to approve its proposal by week’s end.\n\nA small group of House Republicans largely from New York and New Jersey rebelled because the House plan would erase tax deductions for state and local income and sales taxes and limit property tax deductions to $10,000.\n\nTheir numbers seemed insufficient to derail the bill. Asked if they could stop it, Rep. Peter King, R-N.Y., shook his head and said, “I don’t think so.”\n\nThe House measure would collapse today’s seven personal income-tax rates into four: 12, 25, 35 and 39.6 percent. The Senate would have seven rates: 10, 12, 23, 24, 32, 35 and 38.5 percent.\n\nBoth bills would nearly double the standard deduction to around $12,000 for individuals and about $24,000 for married couples and dramatically boost the current $1,000 per-child tax credit.\n\nEach plan would erase the current $4,050 personal exemption and annul or reduce other tax breaks. The House would limit interest deductions to $500,000 in the value of future home mortgages, down from today’s $1 million, while the Senate would end deductions for moving expenses and tax preparation.\n\nEach measure would repeal the alternative minimum tax paid by higher-earning people. The House measure would reduce and ultimately repeal the tax paid on the largest inheritances, while the Senate would limit that levy to fewer estates.\n\nAssociated Press writers Kevin Freking, Richard Lardner and Matthew Daly contributed to this report.", "collection_date": "Fri Nov 17 00:17:39 2017", "publish_date": "2017-11-16 00:00:00", "converted_collection_date": "11-17-2017 00:17:39" },
{ "newsId": 5718340057, "url": "http://www.chicoer.com/general-news/20171215/gop-leaders-finalize-tax-bill-amid-uncertainty-in-senate", "summary": "“We’re putting in a tremendous child tax credit and it is increasing on a daily basis,” Trump said.\nThey have been working to blend different versions of the tax package passed by the House and Senate.\nThe Senate turmoil erupted after a key faction of House Republicans came out in favor of the bill, boosting its chances.\nThey would receive the money in the form of a tax refund, which is why it’s called a “refundable” tax credit.\nRob Portman, R-Ohio, said Senate negotiators got the best deal they could on the overall child tax credit.", "author": [ "Stephen Ohlemacher", "Marcy Gordon", "The Associated Press" ], "src": "http://www.chicoer.com/", "title": "GOP leaders finalize tax bill amid uncertainty in Senate", "keywords": [ "rubio", "republicans", "house", "amid", "uncertainty", "gop", "finalize", "tax", "rubios", "week", "package", "senate", "leaders", "trump", "bill", "credit" ], "news": "Senate Finance Committee Chairman Orrin Hatch, R-Utah, center, talks with Sen. Chris Coons, D-Del., left, as they leave the chamber following a vote, on Capitol Hill, in Washington, Thursday. J. Scott Applewhite — The Associated Press\n\nWASHINGTON >> Congressional Republicans were set to unveil their sweeping tax package Friday amid uncertainty about whether they have the votes to pass it in the Senate and deliver to President Donald Trump his first major legislative victory.\n\nSen. Marco Rubio, R-Fla., was a potential holdout. He wrote on Twitter Friday morning that he was still dissatisfied with the size of a tax credit that low-income families can claim for their children.\n\n“The #workingclass is always forgotten in D.C. We need to add more #taxcuts for #workingclass parents especially those earning 20k- 50K,” Rubio wrote.\n\nAt the White House, Trump said he was confident that Congress would pass the legislation as early as next week. The package would give generous tax cuts to corporations and the wealthiest Americans — Trump among them — and more modest tax cuts to low- and middle-income families.\n\n“We’re putting in a tremendous child tax credit and it is increasing on a daily basis,” Trump said. “I think that we are going to be in a position to pass something as early as next week which will be monumental.”\n\nMembers of a House-Senate conference committee were signing the final version of the legislation Friday. They have been working to blend different versions of the tax package passed by the House and Senate.\n\nRep. Devin Nunes, R-Calif., a member of the committee, said he believed Rubio’s concerns had been met, but Rubio’s office could not confirm it.\n\nRubio’s potential defection pushes the Republicans’ razor-thin majority in the Senate closer to the edge.\n\nSenate Republicans could still pass the package without Rubio’s vote, but they would be cutting it extremely close. An original version was approved 51-49 — with Rubio’s support.\n\nThe Senate turmoil erupted after a key faction of House Republicans came out in favor of the bill, boosting its chances. Members of the conservative House Freedom Caucus predicted the vast majority of their members would support the package.\n\nThe up-and-down turns came after House and Senate Republican leaders forged an agreement in principle on the most sweeping overhaul of the nation’s tax laws in more than 30 years. Republican leaders predicted swift passage next week, sending the bill to Trump for his signature.\n\nAt the White House, Trump said Thursday he was confident that Rubio will get onboard.\n\n“He’s really been a great guy and very supportive. I think that Sen. Rubio will be there,” said Trump, who belittled Rubio during the 2016 GOP presidential primaries, calling him “little Marco.”\n\nAdvertisement\n\nThe tax package would double the per-child tax credit from $1,000 to $2,000. The bill makes a portion of the credit — $1,100 — available to families even if they owe no income tax. They would receive the money in the form of a tax refund, which is why it’s called a “refundable” tax credit. Rubio wants to increase this amount but wouldn’t say by how much.\n\n“Given all the other changes they made in the tax code leading into it, I can’t in good conscience support it unless we are able to increase the refundable portion of it. And there’s ways to do it, and we’ll be very reasonable about it,” Rubio said.\n\nDuring debate on the Senate version of the bill, Rubio proposed a change that would have made the entire $2,000 credit available to families, even if they owe no income tax, but it was soundly defeated. To pay for the expanded credit, he proposed to slightly scale back a steep cut in the corporate income tax rate.\n\nA few days after the earlier Senate vote, Rubio tweeted a link to a news story that said GOP leaders were indeed considering scaling back the corporate tax cut — but not to pay for an expanded child tax credit.\n\n“They freaked out when I proposed small reduction in Corporate tax cut to pay for cut for working families. Now this?” Rubio tweeted.\n\nThe final package slashes the corporate rate from 35 percent to 21 percent. The initial Senate and House bills had set it at 20 percent.\n\nSen. Rob Portman, R-Ohio, said Senate negotiators got the best deal they could on the overall child tax credit. House GOP negotiators were proposing a $1,600 tax credit.\n\n“We won everything in the child tax credit,” Portman said. When asked if it could be changed further to appease Rubio, Portman said: “We’ve already won. I mean, we should celebrate our victory.”\n\nRubio’s opposition comes at a bad time for Senate Republicans, with two of them missing votes this week because of illness.\n\nJohn McCain of Arizona, who is 81, is at a Washington-area military hospital being treated for the side effects of brain cancer treatment, and 80-year-old Thad Cochran of Mississippi had a non-melanoma lesion removed from his nose earlier this week. GOP leaders are hopeful they will be available next week.\n\nAssociated Press writers Kevin Freking and Zeke Miller contributed to this report.\n\nFollow Stephen Ohlemacher on Twitter at http://twitter.com/stephenatap", "collection_date": "Sat Dec 16 00:23:29 2017", "publish_date": "2017-12-15 00:00:00", "converted_collection_date": "12-16-2017 00:23:29" },
{ "newsId": 5718388510, "url": "http://www.dailybreeze.com/2017/09/27/in-alabama-a-mcconnell-rebuke-a-trump-miscalculation/", "summary": "Trump and McConnell quickly closed ranks behind Moore after Strange conceded, underscoring their desire to keep the seat in Republican hands.\nThe Senate Leadership Fund, a McConnell-aligned political action committee, also pledged to support Moore after spending $9 million on Strange’s behalf.\nBannon cast Moore’s romp as a win for Trump, regardless of the president’s Strange endorsement.\nThe fallout cemented Trump’s bond with his core supporters and raised questions about how interested Trump really was in the Alabama race.\n“No other Republican Senate incumbent will carry that baggage,” Ayres said.", "author": [ "The Associated Press" ], "src": "http://www.dailybreeze.com/", "title": "In Alabama, a Trump miscalculation in Senate primary", "keywords": [ "white", "president", "alabama", "miscalculation", "senate", "strange", "primary", "republican", "trumps", "moore", "win", "trump" ], "news": "By BILL BARROW and KIM CHANDLER\n\nHOMEWOOD, Ala.— A firebrand Alabama jurist wrested a U.S. Senate nomination from an appointed incumbent backed by millions of dollars from national Republicans, adding a new chapter Tuesday to an era of outsider politics that ushered Donald Trump into the White House yet leaves his presidency and his party in disarray.\n\nRoy Moore’s 9-point victory over Sen. Luther Strange, backed by the White House and Republican leaders on Capitol Hill, ranks as a miscalculation and temporary embarrassment for the president; it’s a more consequential rebuke for Senate Majority Leader Mitch McConnell, who Moore said should step aside as GOP floor chief.\n\nThe Kentucky Republican already is struggling to capitalize on his narrow 52-48 majority. He failed this week to deliver a long-promised health care overhaul, with equally perilous fights looming on taxes, the budget, immigration and the nation’s credit limit. Now, McConnell may also face a 2018 midterm election cycle complicated by GOP primary challengers who, like Moore, make the Senate leader an albatross for establishment candidates, including incumbents Dean Heller of Nevada and Jeff Flake of Arizona.\n\nMoore, the famed “Ten Commandments judge” twice removed from elected judicial office for defying federal courts, declared his nomination a message to Washington leaders “that their wall has been cracked and will now fall,” though he excepted the president from his ire. “Together we can make America great,” he said, echoing Trump’s campaign slogan.\n\nIn Mississippi, state lawmaker Chris McDaniel, who nearly defeated Sen. Thad Cochran in 2014, called Moore’s win an “incredibly inspiring” blueprint that leaves him on the cusp of challenging Sen. Roger Wicker in 2018. “We know Mitch McConnell was rejected tonight — and Roger Wicker is just another part of Mitch McConnell’s leadership apparatus,” McDaniel told The Associated Press, saying he expects conservative challengers to emerge in other states, as well.\n\nTrump and McConnell quickly closed ranks behind Moore after Strange conceded, underscoring their desire to keep the seat in Republican hands. Trump tweeted congratulations to Moore after the win. “Luther Strange started way back & ran a good race. Roy, WIN in Dec!” he said\n\nThree tweets supporting Strange on Monday and Tuesday disappeared from Trump’s Twitter account. The White House didn’t immediately respond with an explanation. On Wednesday morning Trump sent a tweet praising Moore.\n\n“Spoke to Roy Moore of Alabama last night for the first time. Sounds like a really great guy who ran a fantastic race,” said Trump’s tweet.\n\nThe Senate Leadership Fund, a McConnell-aligned political action committee, also pledged to support Moore after spending $9 million on Strange’s behalf.\n\nA West Point graduate and Vietnam veteran, Moore now is the favorite over Democrat Doug Jones in a Dec. 12 special election, though Republicans quietly worry the sometimes controversial Moore could yield an uncomfortably close race to fill the seat previously held by Attorney General Jeff Sessions.\n\nTrump, meanwhile, must reconcile being the president who promised to “drain the swamp” yet endorsed and campaigned alongside Strange, 64, a lobbyist-turned-politician, in lieu of Moore, a 70-year-old figure steeped in anti-establishment fervor. Adding intrigue was the fact that Strange got his Senate post by being promoted from his job as Alabama attorney general by a now-convicted former governor whom Strange’s office had been investigating for corruption.\n\nTrump’s choice left him opposite from his campaign architect and departed White House adviser Steve Bannon, who campaigned for Moore and introduced the nominee to his supporters Tuesday night as revelers watched returns showing Moore victorious in 63 of Alabama’s 67 counties.\n\nBannon cast Moore’s romp as a win for Trump, regardless of the president’s Strange endorsement. “Who is sovereign, the people or the money? Alabama answered today,” Bannon said.\n\nMississippi’s McDaniel said conservatives never blamed Trump for taking sides. “We supported Donald Trump because he was an agent of change, and he’s still an agent of change,” McDaniel said. “In this instance, he must have been given bad advice to retain this particular swamp creature.”\n\nAnd it’s worth noting that Trump turned his trip to Alabama last week into a national spectacle having nothing to do with Strange or Moore, as the president blasted professional athletes who protest during the national anthem. The fallout cemented Trump’s bond with his core supporters and raised questions about how interested Trump really was in the Alabama race.\n\nElsewhere in Republican ranks, there are warnings not to make the Alabama results more than one state’s choice.\n\nRepublican pollster Whit Ayres, who has worked for Senate campaigns across the country, said Trump learns the same lesson his predecessor, Barack Obama, learned watching Democrats lose control of Congress and then seeing Trump defeat his chosen successor, Hillary Clinton. “You can’t just transfer the popularity of your brand to another candidate,” Ayres said.\n\nAs for Strange, Ayres noted the freshman senator was facing voters for the first time since being appointed by a governor who eventually resigned in disgrace. “No other Republican Senate incumbent will carry that baggage,” Ayres said.\n\nIn defeat, Strange did not directly confront those variables, telling a subdued crowd in suburban Birmingham he was proud of his team’s effort and grateful both to Trump and his Senate colleagues, but befuddled by the campaign he’d just concluded.\n\n“We’re dealing with a political environment that I’ve never had any experience with,” Strange said. “The political seas and winds in this country right now … are very hard to navigate, very hard to understand.”", "publish_date": "2017-09-27 00:00:00", "collection_date": "Wed Sep 27 13:01:19 2017", "converted_collection_date": "09-27-2017 13:01:19" },
{ "newsId": 5718384505, "url": "http://www.dailybreeze.com/government-and-politics/20170926/as-senators-defect-gop-concedes-health-bills-fate-bleak", "summary": "3 GOP Senate leader, said Monday, after Collins joined a small but pivotal cluster of Republicans saying they’re against the measure.\nTo resuscitate their push, Republicans would need to change opposing senators’ minds, which they’ve tried unsuccessfully to do for months.\nCollins told reporters that she made her decision despite a phone call from Trump, who’s been futilely trying to press unhappy GOP senators to back the measure.\nIt would end Obama’s Medicaid expansion and subsidies for consumers and ship the money — $1.2 trillion through 2026 — to states to use on health services with few constraints.\nDesperate to win over reluctant senators, GOP leaders revised the measure several times, adding money late Sunday for Alaska, Arizona, Maine, Kentucky and Texas in a clear pitch for Republican holdouts.", "author": [ "Alan Fram", "Associated Press" ], "src": "http://www.dailybreeze.com/", "title": "As senators defect, GOP concedes health bill’s fate bleak", "keywords": [ "medicaid", "measure", "bills", "senate", "bleak", "senators", "gop", "sen", "obamas", "concedes", "defect", "fate", "republican", "trump", "health", "republicans" ], "collection_date": "Tue Sep 26 14:02:19 2017", "publish_date": "2017-09-26 00:00:00", "news": "The last-gasp Republican drive to tear down President Barack Obama’s health care law essentially died Monday, Sept. 25, as Sen. Susan Collins, R-Maine, joined a small but decisive cluster of GOP senators in opposing the push. (AP Photo/Robert F. Bukaty, File)\n\nWASHINGTON — Republican Sen. Susan Collins’ decision to oppose the GOP push to repeal President Barack Obama’s health care overhaul leaves the effort all but dead, with even party leaders conceding that their prospects are dismal.\n\n“It’s going to be a heavy lift,” South Dakota Sen. John Thune, the No. 3 GOP Senate leader, said Monday, after Collins joined a small but pivotal cluster of Republicans saying they’re against the measure. He called the prospects “bleak.”\n\n“We don’t have the support for it,” said Sen. Orrin Hatch, R-Utah.\n\nThe collapse marks a replay of the embarrassing loss President Donald Trump and party leaders suffered in July, when the Senate rejected three attempts to pass legislation erasing Obama’s 2010 statute. The GOP has made promises to scrap the law a high-profile vow for years, and its failure to deliver despite controlling the White House and Congress has infuriated conservatives whose votes Republican candidates need.\n\nTo resuscitate their push, Republicans would need to change opposing senators’ minds, which they’ve tried unsuccessfully to do for months. Collins told reporters that she made her decision despite a phone call from Trump, who’s been futilely trying to press unhappy GOP senators to back the measure.\n\nBarring a reversal, Senate Majority Leader Mitch McConnell, R-Ky., must decide whether to hold a roll call at all.\n\nThree GOP “no” votes would doom the bill. GOP Sens. John McCain of Arizona, Rand Paul of Kentucky and Texas’ Ted Cruz have said they oppose the measure, though Cruz aides said he was seeking changes that would let him vote yes.\n\nSen. Lisa Murkowski, R-Alaska, remains undecided. Murkowski, who voted against the failed GOP bills in July, has said she’s analyzing the measure’s impact on her state, where medical costs are high.\n\nThis was the last week Republicans had any chance of prevailing with their narrow 52-48 Senate margin. Next Sunday, protections expire against a Democratic filibuster, bill-killing delays that Republicans lack the votes to overcome.\n\nRepublicans had pinned their last hopes on a measure by GOP Sens. Bill Cassidy of Louisiana and South Carolina’s Lindsey Graham. It would end Obama’s Medicaid expansion and subsidies for consumers and ship the money — $1.2 trillion through 2026 — to states to use on health services with few constraints.\n\nAdvertisement\n\nCollins announced her decision shortly after the nonpartisan Congressional Budget Office said “millions” of Americans would lose coverage under the bill and projected it would impose $1 trillion in Medicaid cuts through 2026.\n\nThe Maine moderate said in a statement that the legislation would make “devastating” cuts in the Medicaid program for poor and disabled people, drive up premiums for millions and weaken protections Obama’s law gives people with pre-existing medical conditions. She said the legislation is “deeply flawed,” despite eleventh-hour changes its sponsors have made in search of support.\n\nDesperate to win over reluctant senators, GOP leaders revised the measure several times, adding money late Sunday for Alaska, Arizona, Maine, Kentucky and Texas in a clear pitch for Republican holdouts. They also gave states the ability — without federal permission — to permit insurers to charge people with serious illnesses higher premiums and to sell low-premium policies with big coverage gaps and high deductibles.\n\nLoud protesters forced the Senate Finance Committee to briefly delay the chamber’s first and only hearing on the charged issue. Police lugged some demonstrators out of the hearing room and trundled out others in wheelchairs as scores chanted, “No cuts to Medicaid, save our liberty.”\n\nOn Monday, Trump took on McCain, who’d returned to the Senate after a brain cancer diagnosis in July to cast the key vote that wrecked this summer’s effort. Trump called that “a tremendous slap in the face of the Republican Party” in a call to the “Rick & Bubba Show,” an Alabama-based talk radio program.\n\nCassidy and Graham defended their bill before the Finance committee.\n\n“I don’t need a lecture from anybody about health care,” Graham told the panel’s Democrats. Referring to Obama’s overhaul, he added, “What you have created isn’t working.”\n\nAlso testifying was Sen. Mazie Hirono, D-Hawaii, who learned earlier this year that she has kidney cancer.\n\nShe said colleagues and others have helped her battle the disease with compassion, saying, “Sadly, this is not in this bill.”\n\nAssociated Press Washington bureau chief Julie Pace, and writers Andrew Taylor, Richard Lardner, Laurie Kellman, Ken Thomas and Erica Werner contributed to this report.", "converted_collection_date": "09-26-2017 14:02:19" },
{ "newsId": 5718395056, "url": "http://www.dailybreeze.com/2017/10/05/some-in-gop-open-to-banning-gun-accessory-used-in-vegas/", "summary": "By ERICA WERNERWASHINGTON — Senior congressional Republicans say they are open to considering legislation banning “bump stocks” like the shooter in Las Vegas apparently used to make semi-automatic rifles perform more like fully automatic weapons.\n2 Senate Republican, John Cornyn of Texas, marked a surprising departure from GOP lawmakers’ general antipathy to gun regulations of any kind.\nThe devices, known as “bump stocks” among other names, are legal and originally were intended to help people with limited hand mobility fire a semi-automatic without the individual trigger pulls required.\nAt least one Republican senator, Ron Johnson of Wisconsin, said outright he was prepared to vote to ban “bump stocks.” ”I have no problem in banning those,” he said.\n“Bad people are going to do bad things.”In the House, meanwhile, Rep. David Cicilline, D-R.I., introduced a bill to ban the manufacture, possession, transfer, sale or importation of bump stocks.", "author": [ "The Associated Press" ], "src": "http://www.dailybreeze.com/", "title": "Some in GOP open to banning gun accessory used in Vegas", "keywords": [ "weapon", "gop", "vegas", "open", "accessory", "legislation", "guns", "banning", "ban", "stocks", "gun", "used", "las", "semiautomatic", "republican", "bump" ], "news": "By ERICA WERNER\n\nWASHINGTON — Senior congressional Republicans say they are open to considering legislation banning “bump stocks” like the shooter in Las Vegas apparently used to make semi-automatic rifles perform more like fully automatic weapons.\n\nThe comments from lawmakers including the No. 2 Senate Republican, John Cornyn of Texas, marked a surprising departure from GOP lawmakers’ general antipathy to gun regulations of any kind. But they were far from a guarantee of a path forward for the new legislation by Sen. Dianne Feinstein, D-Calif., especially with Majority Leader Mitch McConnell and House Speaker Paul Ryan making clear their priorities are elsewhere.\n\n“If somebody can essentially convert a semi-automatic weapon by buying one of these and utilizing it and cause the kind of mayhem and mass casualties that we saw in Las Vegas, that’s something of obvious concern that we ought to explore,” Cornyn told reporters.\n\n“I own a lot of guns and as a hunter and sportsman I think that’s our right as Americans, but I don’t understand the use of this bump stock and that’s another reason to have a hearing.”\n\nCornyn later said he’d spoken with Judiciary Committee Chairman Chuck Grassley, and that Grassley was interested in convening a hearing.\n\nThe devices, known as “bump stocks” among other names, are legal and originally were intended to help people with limited hand mobility fire a semi-automatic without the individual trigger pulls required. They can fit over the rear shoulder-stock assembly on a semi-automatic rifle and with applied pressure cause the weapon to fire continuously, increasing the rate from between 45 and 60 rounds per minute to between 400 and 800 rounds per minute, according to Feinstein’s office.\n\nThe government gave its seal of approval to selling the devices in 2010 after concluding that they did not violate federal law.\n\nFeinstein has a career-long history on the issue of guns after becoming mayor in San Francisco after her predecessor was gunned down. She authored an assault weapons ban that was in place for a decade before expiring in 2004, and said she had been considering trying to reintroduce that more sweeping legislation, as she’s done unsuccessfully after past mass shootings, including the one at Sandy Hook elementary school in Connecticut. Senate Minority Leader Chuck Schumer urged her to go with a narrower bill that might be likelier to draw support.\n\nFeinstein pleaded with the public to pressure Congress to consider her legislation after the horrific violence earlier this week when a gunman killed 58 people and injured hundreds at an outdoor concert that she said her own daughter had considered attending.\n\n“Mr. and Mrs. America, you have to stand up, you have to say ‘enough is enough,'” Feinstein said. “Why can’t we keep a weapon from becoming a military-grade weapon?”\n\nThe National Rifle Association, which has played a major role in exerting political pressure against gun curbs, did not respond to inquiries about its stance on Feinstein’s bill.\n\nAt least one Republican senator, Ron Johnson of Wisconsin, said outright he was prepared to vote to ban “bump stocks.” ”I have no problem in banning those,” he said.\n\nSen. John Thune of South Dakota, the No. 3 Republican senator, said, “I’m interested in finding out more about bump stocks and I’ve got my staff looking into that and I know there are other members interested in finding out more about it as well.”\n\nEven so, asked Tuesday about “bump stocks” and whether they should be legal, McConnell, R-Ky., said it was not an appropriate time to be discussing legislation.\n\nRyan, R-Wis., made similar comments Wednesday in a radio interview on WISN in Milwaukee.\n\n“What I don’t think you want your government to do is to lurch toward reactions before even having all the facts,” Ryan said. “Bad people are going to do bad things.”\n\nIn the House, meanwhile, Rep. David Cicilline, D-R.I., introduced a bill to ban the manufacture, possession, transfer, sale or importation of bump stocks. Rep. Dina Titus, D-Nev., whose district includes the site of Sunday night’s rampage, said: “The victims and families in Las Vegas don’t need an explanation about the difference between machine guns and firearms with bump stocks. They need action.”\n\nCongress’ recent history gives little cause to think Republicans would take any action on guns. Even after the 2012 Sandy Hook shooting where schoolchildren were slaughtered, Feinstein’s reintroduced assault weapons ban went nowhere, and bipartisan background check legislation by Democratic Sen. Joe Manchin of West Virginia and Republican Sen. Pat Toomey of Pennsylvania fell short on the Senate floor.\n\nLast year, after the mass shooting at a dance club in Orlando, Florida, Democrats commandeered the House floor to protest GOP inaction on guns, but while garnering headlines the tactic did not yield results. Shooting incidents involving lawmakers themselves, like at a baseball practice earlier this year where Majority Whip Steve Scalise was critically injured, have not changed the calculus.\n\nFeinstein held out hope that this time would be different because of the scale of casualties and the weaponry “taking it into war.” And Manchin said that he planned to meet with Toomey on the background checks bill, but would not reintroduce it without significant GOP support, which he said “ain’t going to happen unless the president gives his stamp of approval.”\n\nPresident Donald Trump visited Las Vegas on Wednesday but said “We’re not going to talk about that today” when asked about gun issues.\n\n___\n\nAssociated Press writer Matthew Daly contributed.", "collection_date": "Thu Oct  5 14:02:26 2017", "publish_date": "2017-10-05 00:00:00", "converted_collection_date": "10-05-2017 14:02:26" },
{ "newsId": 5718205204, "url": "http://www.chicoer.com/business/20170920/editorial-roundup-excerpts-from-recent-editorials", "summary": "It seems that Guterres aims to implement reforms also by using the pressure being applied by the United States and other nations as leverage.\nThe efforts of the United States, the largest contributor to this budget, to cooperate with Japan, the third-largest contributor, in strongly calling for more efficiency have been successful.\nJapan is the second-largest contributor to the overall U.N. budget after the United States.\nMr. Wyden and Mr. Merkley said Mr. Trump had completely bypassed Oregon's well-established bipartisan selection committee.\nThis nation could use real tax reform that makes the complicated federal tax code fairer and simpler without raising the deficit.", "author": [ "The Associated Press" ], "src": "http://www.chicoer.com/", "title": "Editorial Roundup: Excerpts from recent editorials", "keywords": [ "editorial", "roundup", "congress", "states", "senators", "president", "recent", "mr", "federal", "trump", "united", "editorials", "republicans", "tax", "excerpts" ], "news": "Excerpts from recent editorials in the United States and abroad:\n\n___\n\nSept. 15\n\nThe Japan News on United Nations reform and the U.S. and Japan's contributions to its budget:\n\nAdvertisement\n\nThe United Nations faces a mountain of pressing issues it should tackle, including North Korea's nuclear development program, terrorism perpetrated by extremist groups, conflicts and poverty. The U.N. will not be able to effectively deal with these issues if it continues to operate as a bureaucratic organization.\n\nThe 72nd session of the U.N. General Assembly has started. One of the session's main themes will be U.N. reforms to boost the organization's transparency and more efficiently use its budget, which is accrued from contributions paid by each nation.\n\nIn his opening remarks, U.N. Secretary General Antonio Guterres, who assumed the post in January, emphasized his desire to improve the international body's structure, saying, \"The United Nations must do even more to adapt and deliver . (and) to strengthen our organization to . produce better results.\"\n\nA major focus of this session will be the approach taken by U.S. President Donald Trump in his maiden appearance at the General Assembly.\n\nA high-level meeting on U.N. reforms will be held Monday. A political statement calling for reforms that create a \"more efficient organization\" and expressing support for Guterres' efforts is expected to be announced.\n\nTrump has championed an \"America first\" policy and cast a stern eye toward international institutions. Each member nation's share of the U.N. regular budget is determined based on their economic strength and ability to pay. Trump has expressed displeasure that the United States contributes the maximum rate of 22 percent of the budget, a figure he described as \"unfair.\"\n\nThe U.N. regular budget has doubled in the past 20 years. Wasteful expenditures must be cut by reviewing unnecessary departments and operations. It also is necessary to cancel out any room for U.N. agencies such as UNESCO to be exploited for political purposes on historical and other issues by fortifying their neutrality.\n\nPush for UNSC expansion\n\nIt will not be easy to eradicate long-established common practices and internal resistance in pushing ahead with organizational reforms. It seems that Guterres aims to implement reforms also by using the pressure being applied by the United States and other nations as leverage.\n\nThe budget for U.N. peacekeeping operations in fiscal 2017 (July 2017 to June 2018) has already been slashed by 14 percent from the previous fiscal year. The efforts of the United States, the largest contributor to this budget, to cooperate with Japan, the third-largest contributor, in strongly calling for more efficiency have been successful.\n\nJapan is the second-largest contributor to the overall U.N. budget after the United States. Japan's 9.7 percent share means the nation pays about 27 billion annually. It is vital the nation actively participates in running the United Nations and pushes for greater streamlining.\n\nReforming the U.N. Security Council is also an important issue. Japan has directly played a part as a nonpermanent member of the council in actions such as promoting resolutions for imposing sanctions on North Korea, but the nation's term on the council will expire at the end of this year. Japan must tenaciously continue moves to expand the Security Council so the nation can secure a permanent seat at the table.\n\nLeaders from around the world, including Trump and Prime Minister Shinzo Abe, will lay out their nations' diplomatic and security policies in addresses at the annual general debate that opens on Tuesday. Leaders also will hold bilateral meetings. Given the growing tension over North Korea-related issues, it will be important to confirm at every occasion that the sanctions slapped on Pyongyang will be strictly enforced.\n\nOnline: http://the-japan-news.com/\n\n___\n\nSept. 15\n\nThe New York Times on Congressional majority leaders looking to eliminate a tool the minority party has to influence a president's picks for federal courts:\n\nNow that Republicans control both the White House and Congress, top party officials, including Mitch McConnell, the Senate majority leader, are itching to eliminate the last remaining tool the minority party has to influence a president's picks for the federal courts \u0097 the so-called blue slip.\n\nThis longtime but informal Senate practice allows a senator to block the nomination of a judge from his or her home state by refusing to sign off on a blue-colored form. The idea was to give senators, who are presumed to be more familiar with the lawyers and judges in their own states, a meaningful say in the choosing of those judges. It also works as an incentive for moderation in staffing the federal judiciary, which, as the only unelected branch of government, depends on the public trust for its legitimacy.\n\nBut with Democratic senators now refusing to agree to hearings for two of President Trump's nominees to the federal appeals courts, Mr. McConnell told The Times that the blue slip \"ought to simply be a notification of how you're going to vote, not the opportunity to blackball.\"\n\nWhat a difference a few years make.\n\nBack in 2009, Mr. McConnell and the entire Republican Senate caucus \u0097 then in the minority \u0097 implored President Barack Obama to honor all blue slips. The appointment of federal judges is a \"shared constitutional responsibility,\" the Republicans said, warning Mr. Obama that \"if we are not consulted on, and approve of, a nominee from our states,\" the senators intended to prevent that nominee from getting a hearing. They expected the blue-slip policy \"to be observed, even-handedly and regardless of party affiliation.\"\n\nLucky for them, it was. Senator Patrick Leahy, the veteran Vermont Democrat and chairman of the Judiciary Committee at the time, applied the policy without exception, meaning that a single withheld blue slip would torpedo a judicial nomination.\n\nRepublican senators exploited their blue slips with abandon, and with little or no explanation. One senator blocked a nominee because she had once said the Constitution did not protect an individual right to bear arms \u0097 an accurate description of the uncertainty about the law at the time. Other senators blocked nominees they had previously approved for other courts, or even recommended to the White House themselves. In all, 18 of Mr. Obama's judicial nominees were scuttled, including six to the Courts of Appeals. That's not counting dozens more vacancies that languished for years without a nominee because senators made it clear they would object to anyone.\n\nThis abuse of blue slips led many, including this page, to call for an end to the practice, but Mr. Leahy continued it \u0097 as did Senator Charles Grassley of Iowa, who became chairman of the Judiciary Committee after Republicans won the Senate in 2014. President Trump now has 144 vacancies to fill on the federal bench, many as a direct result of Republican intransigence during the Obama era. So it's particularly rich, if not surprising, for Republicans to urge its demise.\n\nWhat led them to this? In short, the same behavior that they had engaged in with impunity. This month, Senator Al Franken, Democrat of Minnesota, refused to return his blue slip for David Stras, a well-respected but very conservative justice on the state's Supreme Court whom Mr. Trump nominated to the Court of Appeals for the Eighth Circuit. Last week, Oregon's two Democratic senators, Ron Wyden and Jeff Merkley, opposed another of Mr. Trump's appeals court picks, Ryan Bounds.\n\nUnlike their Republican counterparts, however, these Democrats provided a clear explanation for their opposition: The White House, they said, made no meaningful effort to consult with them before making nominations. Mr. Wyden and Mr. Merkley said Mr. Trump had completely bypassed Oregon's well-established bipartisan selection committee.\n\nThese are fair complaints. The Constitution gives the president the power to choose federal judges, but only with the \"advice and consent\" of the Senate. In an earlier era of relative comity and good faith, the blue-slip tradition may have helped to ensure that advice was considered. But in this toxic, hyperpartisan age, there's no simple way to force a president to listen.\n\nAnd that is not a minor matter. Any president, not least one who lost the popular vote by almost three million votes, should take account of the wishes and concerns of senators of the opposing party. Mr. Obama made concessions to Republican senators in states like Oklahoma and Utah, and he tried for years to negotiate with others, often to no avail. In contrast, Mr. Trump, not even eight months into his presidency, has farmed out the selection of judges to conservative advocacy groups like the Heritage Foundation and the Federalist Society, which have spent decades plotting for a right-wing takeover of the federal courts.\n\nThe push toward ever-more extreme judges will only further politicize the third branch. Still, the blue slip is no longer the answer. As we argued in 2014, senators who oppose a nominee can state their objections on the Senate floor and try to persuade their colleagues \u0097 something Mitch McConnell was too cowardly to do in 2016, when he refused to allow even a hearing for Merrick Garland, Mr. Obama's pick for the Supreme Court vacancy.\n\nFor the next few years, at least, Democrats will have to grit their teeth and watch as hard-right judges begin to restock the federal bench. But Republicans who are gloating right now over their near-total control of Washington might remember one of the more painful realities of politics: No majority lasts forever.\n\nOnline: https://www.nytimes.com/\n\n___\n\nSept. 14\n\nLos Angeles Times on the bipartisan discussion between Congressional minority leaders and President Donald Trump over the Deferred Action for Childhood Arrivals program:\n\nFor a few interesting hours, it looked as though the White House and Democratic leaders in Congress had found a path forward for resolving the conundrum of the so-called Dreamers, immigrants who have lived in the U.S. without legal permission since they were children.\n\nAfter dinner at the White House on Wednesday, Senate Minority Leader Charles E. Schumer and House Minority Leader Nancy Pelosi announced they had the outline of a deal with President Trump in which the protections that had been promised under President Obama's Deferred Action for Childhood Arrivals program \u0097 and then rescinded by Trump \u0097 would be reestablished and enshrined into law. As part of the deal, the Democrats would support enhanced border security measures, and the showdown over Trump's border wall would be pushed off to some future date.\n\nBut the bipartisan moment didn't last long. The White House quickly responded that there had been a discussion, but that no deal had been reached; leading Republicans condemned the idea. Then on Thursday morning Trump seemed to back still farther away when he told reporters that \"if there's not a wall, we're doing nothing.\" He also said that he was not contemplating a path to citizenship for the Dreamers, just temporary protection from deportation. By Thursday afternoon, Trump was talking about maybe a DACA deal first if the Democrats promised not to block the wall later.\n\nIt would be outrageous, frankly, if they can't reach an agreement. Trump's decision earlier this month to withdraw the DACA protections promised to some 800,000 people \u0097 most of whom came to this country as a result of decisions made by their parents \u0097 was cruel and unnecessary. But if the protections could be restored to them by Congress as a matter of law (rather than merely presidential executive action), the Dreamers would be in even better shape than they were under Obama. The flurry of \"deal-no deal\" reports raises some tentative hope that there still might be a resolution.\n\nThe original Dream Act that was introduced in Congress year after year would have provided a path to legal status and ultimately to citizenship. But it never passed. That led Obama to create the DACA program in 2012 to provide the Dreamers with some stability and permission to work until Congress could fix the problem.\n\nTrump, though, rode anti-immigrant fervor to the White House; among other things, he promised to deport DACA participants. He softened his stance for a while, telling the Dreamers he was \"gonna deal with DACA with heart.\" But then he announced this month that the program would be phased out in March 2017 unless Congress acted to give the Dreamers legal status. So the Dreamers are once again \u0097 or still \u0097 twisting in the wind.\n\nWe hope the president and leaders of both parties in Congress can find a way to make this work. Fairness demands it, as do most of the American people. The Dreamers deserve not just protection from deportation, but a path to true citizenship. These are people, after all, who often have spent little time in the country where they were born, speak only English and have been brought up as Americans. To qualify for DACA protections, they had to be in school or have graduated or to have been in the military.\n\nTrump should set aside his insistence on his silly wall \u0097 which even many of his fellow Republicans dismiss as unnecessary and excessively costly \u0097 and put the well-being of the Dreamers ahead of his ill-advised campaign promises.\n\nOnline: http://www.latimes.com/\n\n___\n\nSept. 18\n\nChicago Tribune on a recent speech by Education Secretary Betsy DeVos about college campus sexual assault allegations:\n\nFor much of this decade, Americans have debated how college administrators should handle allegations of campus sexual assaults. How to balance the rights of the victim and the accused. How to punish perpetrators and deter predators. How to make campuses safer.\n\nThe Obama administration urged colleges in a notorious 2011 \"Dear Colleague\" letter to get tougher on sexual assault allegations or possibly forfeit millions in federal funding. The 19-page guideline reminded officials they should use a low burden of proof, \"preponderance of evidence,\" when weighing an accused student's guilt or innocence. It also prompted the U.S. Department of Education's Office for Civil Rights to open many more inquiries into colleges for their allegedly slipshod handling of sexual violence allegations.\n\nBut the crackdown also generated an intense backlash among accused students and their families, who claimed their rights were trampled by inept campus judicial systems too heavily tilted in favor of alleged victims.\n\nNow Education Secretary Betsy DeVos has signaled that the Trump administration soon will send the \"Dear Colleague\" letter to the shredder. \"Through intimidation and coercion, the failed system has clearly pushed schools to overreach,\" DeVos said in a recent speech. \"With the heavy hand of Washington tipping the balance of her scale, the sad reality is that Lady Justice is not blind on campuses today.\"\n\nShe added: \"It's no wonder so many call these proceedings 'kangaroo courts.' \"\n\nSo how will DeVos change federal policy? Unclear. She says she's still soliciting ideas. In her speech, however, DeVos mentioned several proposals from lawyers' groups that would raise evidence standards or set up independent panels to handle complaints, possibly on a regional basis.\n\nWe have a better idea, Secretary DeVos: Don't create an elaborate new system. Let the criminal justice system in place \u0097 local prosecutors and police \u0097 handle these cases. That's what they're equipped to do in ways that college tribunals and well-intentioned administrators are not.\n\nLaw enforcement authorities have plenty of experience because sexual assault is not, regrettably, an isolated crime or one limited to colleges. It is alarmingly widespread, on campus and off. More than 20 percent of female undergrads at various colleges said they were victims of sexual assault and misconduct, according to a 2015 survey by the Association of American Universities. Yet young women who skip college have an even higher chance of being sexually assaulted than their college peers, according to federal figures released in 2014.\n\nWhy shove aside college administrators, faculty members and security forces in these cases? Because they lack the expertise and the resources of local authorities to investigate allegations, to process evidence, to interview witnesses and ferret out the truth. For years, college authorities have mishandled campus sexual assault cases. One reason: Some college officials are more concerned about their schools' reputations (and, possibly, their jobs) than with helping police and prosecutors aggressively pursue allegations. Law enforcement authorities can approach a heater case without fretting over a university's reputation or ranking.\n\nCampus administrators also are ill-prepared to parse ambiguities and difficult judgments that can make these cases challenging. Prosecutions often pivot on he-said she-said accounts of whether sexual contact was consensual. Alcohol or drugs often are involved. Some victims decline to pursue charges. But civil authorities are accustomed to navigating those treacherous waters; college administrators aren't.\n\n\"Washington has burdened schools with increasingly elaborate and confusing guidelines that even lawyers find difficult to understand and navigate,\" DeVos says. \"Where does that leave institutions, which are forced to be judge and jury? Where does that leave parents? Where does that leave students?\"\n\nThat's the right question. Washington has a vital role here: Smaller. The next Dear Colleague letter doesn't need to be 19 pages. It can be a brisk paragraph. It should instruct campus officials to get out of the way of cops and prosecutors. Hand over these sensitive cases to the professionals. Let them do their jobs.\n\nOnline: http://www.chicagotribune.com/\n\n___\n\nSept. 16\n\nSt. Louis Post-Dispatch on protests after former police officer Jason Stockley was acquitted in the 2011 shooting death of Anthony Lamar Smith:\n\nThe understandable sense of outrage over Friday's not-guilty verdict in the Jason Stockley trial culminated in a frenzy of nighttime violence that defies logic. Particularly confusing was the decision of protesters to attack Mayor Lyda Krewson's home and a public library branch.\n\nThe St. Louis Police Department handled Friday's mostly peaceful daytime protests deftly, in sharp contrast to the harsh military-style responses the 2014 police-shooting death of Michael Brown in Ferguson. This time, protesters got ample room to march, yell and vent their anger over former Officer Jason Stockley's acquittal for the 2011 shooting death of Anthony Lamar Smith.\n\nWhen bricks and water bottles were hurled, officers employed pepper spray and made arrests.\n\nAnticipating that protesters would take to the highways, police blocked ramps at strategic locations while generally avoiding overt confrontation. Where police correctly drew the line was when the protests turned violent.\n\nSome protesters have said they plan to attack symbols of commerce and inflict discomfort on the comfortable. Even if they rationalize property destruction as legitimate protest, why attack the mayor's house?\n\nKrewson was only elected mayor in April and had nothing to do with the trial or the way police and prosecutors handled the too-long investigation into Smith's death. Her first act in office was to oust Police Chief Sam Dotson.\n\nOn Friday, she stated that she was \"appalled by what happened\" to Smith and was \"sobered by the outcome\" of Stockley's trial. She clearly shared protesters' incredulity over the verdict, as did other politicians.\n\nKrewson has suffered more than her share of \"discomfort.\" She entered public service as an alderman after the 1995 shooting death of her husband during an attempted carjacking outside their home. Krewson and her children were present. In what twisted sense does attacking her home serve as retribution for Stockley's acquittal?\n\nEqually absurd is the attack on a Central West End library branch, where windows were broken and the interior trashed. What's the message here, that books and knowledge are bad? Attacking a public library only underscores the ignorance of the vandals themselves.\n\nNo one should rest comfortably after hearing the verdict and knowing the multiple ways that Stockley violated police procedures in his hot pursuit of Smith, a suspected drug dealer who was fleeing arrest.\n\nStockley got his day in court, but he denied Smith the same right by appearing, in the eyes of many, to serve as judge, jury and executioner at the scene of the shooting. Stockley's recorded statement of an intent to kill Smith seconds before doing so was one of many disturbing elements in this case.\n\nNo matter how much property is destroyed, neither Stockley's actions nor the verdict can be undone. Inflicting more injustice will never get protesters the justice they seek.\n\nOnline: http://www.stltoday.com/\n\n___\n\nSept. 15\n\nTampa Bay Times on U.S. tax reform:\n\nPresident Donald Trump is in a big rush for Congress to approve big tax cuts, and he is using the damage left by Hurricane Irma to argue his case. One has nothing to do with the other, except for their negative impact on middle-class Floridians. The nation needs tax reform, but not tax cuts for the wealthy that would sacrifice popular tax deductions and raise the federal deficit.\n\nBefore he traveled to Florida to survey the damage last week, Trump tweeted: \"With Irma and Harvey devastation, Tax Cuts and Tax Reform is needed more than ever. Go Congress, go!\" No, Congress, slow down. Tax cuts are not going to lessen the financial impact of the hurricanes, and there often is an economic stimulus after major storms as communities recover. Real tax reform takes time to refine and build consensus, and the last thing this nation needs is unfunded tax cuts like those enacted under President George W. Bush.\n\nTrump promises the largest tax cut in history and met privately last week with key Republicans and Democrats, but details aren't expected to be released until later this month. The president wants to cut the top federal corporate tax rate from 35 percent to 15 percent, although congressional negotiators are aiming for roughly a 20 percent rate. Republicans point out the U.S. corporate tax rate is the highest in the world, but in fact most companies pay a far lower rate, and after deductions and credits the highest effective tax rate is just over 19 percent.\n\nDramatically cutting corporate tax rates would not bring back the factories to the Midwest as the president promised. It would not create the millions of new jobs he talks about or increase economic growth by the wild numbers he tosses around. In fact, nonpartisan studies consistently suggest most of the benefits of corporate tax cuts go to company owners or investors, not to hire more workers or raise wages.\n\nSimilarly, Trump's rhetoric is at odds with the math regarding his proposed reduction of seven individual tax brackets to three tax brackets of 10, 25 and 35 percent. The president said on his trip to Florida last week that he wants to cut taxes for the middle class and that \"the wealthy Americans are not my priority.\" Yet the Urban Institute-Brookings Institution Tax Policy Center estimates 40 percent of the benefits would go to the top 1 percent of households, which make more than $732,000 a year. Income inequality already is a major issue in this country, and the outlines of the president's rough plan would make that worse.\n\nTrump also is pushing an old Republican favorite: eliminating the estate tax. Republicans love to call the estate tax \"the death tax,\" but the idea that family farms and small businesses are being routinely lost because of the estate tax is a myth. Congress' Joint Committee of Taxation says far less than 1 percent of all Americans pay any estate tax, and nearly all of them are among the wealthiest 5 percent. This is another tax break for the wealthy, not the middle class.\n\nPredictably, negotiators for Congress and the Trump administration are struggling to find ways to pay for tax cuts that the Tax Policy Center estimates could cut federal revenue by up to $7.8 trillion over the next decade. Trump's notion that economic growth will pay for most of it is fantasy, and Democrats are not going to sacrifice popular tax deductions such as those for mortgage interest and charitable donations to help pay for tax cuts for the rich. While some deficit spending could be justified for initiatives that would stimulate the economy, such as a substantial investment in infrastructure, there is no reason to add to the deficit for tax cuts to fulfill a campaign promise.\n\nThis nation could use real tax reform that makes the complicated federal tax code fairer and simpler without raising the deficit. But unless there is a sudden epiphany in Washington, what Trump and congressional leaders are pursuing is not tax reform. It's just another tax cut for the wealthy that the nation cannot afford.\n\nOnline: http://www.tampabay.com/", "publish_date": "2017-09-20 00:00:00", "collection_date": "Wed Sep 20 16:02:58 2017", "converted_collection_date": "09-20-2017 16:02:58" },
{ "newsId": 5718339870, "url": "http://www.chicoer.com/general-news/20171214/pence-to-delay-trip-to-mideast-over-tax-bill", "summary": "WASHINGTON >> Vice President Mike Pence plans to delay his weekend departure for the Middle East as Congress nears completion of a tax overhaul, White House officials said Thursday.\nWhite House officials said Pence now plans to leave for Egypt on Tuesday so he can preside over the Senate during a vote on the tax package.\nPence had been scheduled to leave Saturday for Israel, following President Donald Trump’s decision to recognize Jerusalem as Israel’s capital.\nWhite House officials said Pence will travel first to Egypt and then to Israel.\nWhite House officials said they do not expect Pence’s vote to be needed on the tax bill.", "author": [ "Ken Thomas", "The Associated Press" ], "src": "http://www.chicoer.com/", "title": "Pence to delay trip to Mideast over tax bill", "keywords": [ "bill", "jerusalem", "officials", "pence", "vote", "house", "meet", "tax", "trip", "trumps", "president", "mideast", "israel", "delay" ], "publish_date": "2017-12-14 00:00:00", "news": "WASHINGTON >> Vice President Mike Pence plans to delay his weekend departure for the Middle East as Congress nears completion of a tax overhaul, White House officials said Thursday.\n\nWhite House officials said Pence now plans to leave for Egypt on Tuesday so he can preside over the Senate during a vote on the tax package.\n\nPence had been scheduled to leave Saturday for Israel, following President Donald Trump’s decision to recognize Jerusalem as Israel’s capital. White House officials said Pence will travel first to Egypt and then to Israel.\n\nThe officials spoke on condition of anonymity because they weren’t authorized to publicly describe scheduling details.\n\nThe officials said Pence’s trip will be abbreviated after Palestinian officials and leading Muslim and Christian clerics in Egypt refused to meet with him during his trip to the region.\n\nTrump and Republican lawmakers are hoping for a vote early next week on the delivery of a package of steep tax cuts for corporations and more modest cuts for families before Christmas. Republicans can afford to lose two votes while counting on Pence to break a tie.\n\nWhite House officials said they do not expect Pence’s vote to be needed on the tax bill. But Republican Sens. John McCain of Arizona and Thad Cochran of Mississippi have missed votes recently because of health issues and Pence’s decision to preside over the Senate would ensure he’d be available to cast a tie-breaking vote if necessary.\n\nPence has been forced to adjust his schedule in the Middle East amid protests from leaders over Trump’s recognition of Jerusalem as Israel’s capital. Aides to Palestinian President Mahmoud Abbas, who has condemned Trump’s decision, said earlier this week that he would not meet with the vice president. Abbas had originally planned to host Pence, a devout Christian, in the biblical West Bank town of Bethlehem.\n\nPence is scheduled to meet Wednesday in Cairo with Egypt’s President Abdel-Fattah el-Sissi, a close ally of Trump. Pence will arrive in Israel later Wednesday for a visit to the Western Wall. The vice president will then meet Thursday with Israeli Prime Minister Benjamin Netanyahu, deliver an address to the Knesset and later dine with Netanyahu.\n\nWhite House officials said Pence will wrap up his trip to Israel on Friday with a meeting with Israeli President Reuven Rivlin and visit the Yad Vashem Holocaust memorial.\n\nAdvertisement\n\nThe status of Jerusalem has been a central issue in the decades-long Israeli-Palestinian conflict and Trump’s announcement last week was widely perceived as siding with Israel. The decision upended decades of U.S. foreign policy and countered an international consensus that Jerusalem’s status should be decided in negotiations between Israel and the Palestinians, who claim east Jerusalem as the capital of their future state.\n\nThe White House has said Trump remains committed to the goal of peace and notes he has not taken a position on the boundaries of Israeli sovereignty in Jerusalem or resolution of its contested borders.\n\nTrump has set an ambitious goal of brokering Mideast peace and tasked his son-in-law and senior adviser Jared Kushner to help lay the groundwork for direct negotiations. Kushner and other top Trump aides have traveled to the region to meet with Palestinians, Israelis and officials from Arab nations.\n\nPence’s trip is scheduled to end on Dec. 23 with a pre-Christmas visit with troops stationed at the United States’ Ramstein Air Base in Germany.\n\nOn Twitter follow Ken Thomas at @KThomasDC.", "collection_date": "Fri Dec 15 00:13:25 2017", "converted_collection_date": "12-15-2017 00:13:25" },
{ "newsId": 5718377962, "url": "http://www.dailybreeze.com/social-affairs/20170917/shadows-of-secrecy-begin-to-spread-across-federal-government", "summary": "Still, a new slate of top aides, including White House Chief of Staff John Kelly and presidential spokeswoman Sarah Huckabee Sanders, seems to have opened pinpricks of light and lowered the temperature in the daily White House briefing.\nSome White House briefings were declared off-limits for video or audio.\nAsked what the Trump administration is doing to foster openness in government, a White House spokeswoman did not respond.\nTrump’s core supporters seem to be OK with this, he said, “as if new degrees of federal government secrecy are actually better for the country.”It’s not just the White House.\nThat’s been Donald Trump’s life,” said Richard Painter, who served as George W. Bush’s White House ethics lawyer.", "author": [ "Laurie Kellman", "Associated Press" ], "src": "http://www.dailybreeze.com/", "title": "Shadows of secrecy begin to spread across federal government", "keywords": [ "shadows", "trump", "spread", "administration", "trumps", "begin", "secrecy", "requests", "records", "house", "president", "senate", "federal", "white" ], "publish_date": "2017-09-17 00:00:00", "news": "Senate Majority Leader Mitch McConnell of Ky., looks out after boarding an elevator at Capitol Hill in Washington. In 2017, McConnell opted to privately negotiate an ultimately unsuccessful bill to overhaul Obama’s Affordable Care Act. AP Photo/Carolyn Kaster\n\nWASHINGTON >> There are cracks in the curtains President Donald Trump tried to draw around the government early in his presidency, but the slivers of light aren’t making it easier to hold federal officials accountable for their actions.\n\nTrump still refuses to divest from his real estate and hotel empire or release virtually any of his tax returns. His administration is vigorously pursuing whistleblowers. Among scores of vacant senior jobs in the government is an inspector general for the Department of Energy — led by Secretary Rick Perry, former governor of Texas — as it helps drive the region’s recovery from Hurricane Harvey.\n\nRebuilding from the deadly storm seems certain to be a $100 billion-plus endeavor involving multiple federal departments and an army of government contractors. If the ghosts of Katrina, Sandy and other big storms are guides, the bonanza of taxpayer dollars is a recipe for corruption. And that makes transparency and accountability all the more critical for a president who has bristled at the suggestion of either one.\n\n“This is an administration that wants to do things their own way and a president that wants to do things his own way,” said Rick Blum, director of News Media for Open Government, of which The Associated Press is a member. “(Trump) is frustrated by the institutions our founders established. And he’s going to have to learn that the public deserves a free and independent press.”\n\nTo be sure, Trump has not backed off his fury with the media or his branding of reporters as “enemies of the people” who want to harm the country. He still calls revelations he doesn’t like “fake news.” And he tweets untruths himself, including that he witnessed Harvey’s devastation “first hand” during his first visit to Texas on the edges of the disaster zone.\n\nStill, a new slate of top aides, including White House Chief of Staff John Kelly and presidential spokeswoman Sarah Huckabee Sanders, seems to have opened pinpricks of light and lowered the temperature in the daily White House briefing.\n\nTrump has let fade his threat to scrap the daily question-and-answer sessions in favor of written questions and responses since the dismissals of Reince Priebus, Sean Spicer and Steve Bannon from his inner circle. Education Secretary Betsy DeVos gave the AP an interview about education policy.\n\nBut there’s a far longer record of the Trump administration’s secrecy, despite Trump’s campaign vow to “drain the swamp” of Washington.\n\nHis administration has served notice that the executive branch could ignore some information requests from Congress with a few exceptions.\n\nAdvertisement\n\n“Nonsense,” said Judiciary Committee Chairman Chuck Grassley, an outspoken advocate of open government. “Shutting down oversight requests doesn’t drain the swamp, Mr. President. It floods the swamp.”\n\nMembers of the administration have resisted being questioned. Some White House briefings were declared off-limits for video or audio. And in July, during the president’s second overseas trip, the administration insisted that a briefing by Secretary of State Rex Tillerson on Trump’s meeting with Russian President Vladimir Putin be off-camera. Trump also barred the U.S. media from his White House meeting with Russian officials, only to see photos of the Oval Office session surface in the Russian media.\n\nThe signs of struggle included the resignation in July of the government’s ethics chief, Walter Shaub, after an extraordinary public fight with Trump’s lawyers over potential conflicts of interest. Shaub, an Obama appointee leaving short of the end of his five-year term, had tried unsuccessfully to get Trump to fully divest from his business empire.\n\nAs with most new administrations, Trump’s Justice Department has not issued its own its official policy on complying with one of the cornerstones of open government, the federal Freedom of Information Act. Asked what the Trump administration is doing to foster openness in government, a White House spokeswoman did not respond.\n\n“Trump and his closest aides appear to have little respect for the very processes of government, and therefore little appreciation of the public’s need to know of them as part of our democratic process,” said Daniel J. Metcalfe, the founding director of the Justice Department’s Office of Information and Privacy who teaches secrecy law at American University.\n\nTrump’s core supporters seem to be OK with this, he said, “as if new degrees of federal government secrecy are actually better for the country.”\n\nIt’s not just the White House.\n\nProceedings of the House and Senate are televised live, as are many congressional hearings. But Senate leaders this year briefly tried to bar reporters from conducting televised hallway interviews without permission. And Senate Majority leader Mitch McConnell opted to privately negotiate an ultimately unsuccessful bill to overhaul Obama’s Affordable Care Act. Closing the beginning of the bill-writing process is unusual, though when the original bill was passed, negotiators closed it at the end, to get a final deal.\n\nThe Obama administration in its final year spent a record $36.2 million on legal costs defending its refusal to turn over federal records under FOIA, an Associated Press analysis showed earlier this year. The Obama administration also set records for outright denial of access to files, refusing to quickly consider requests described as especially newsworthy, for example.\n\nBut Obama signed two executive orders and a set of memoranda on his first day in office that directed the government to revert toward openness. One directive reversed policy by President George W. Bush that made it easier for government agencies to deny Freedom of Information Act requests for records. Another effectively repealed a Bush executive order that allowed former presidents or their heirs to keep records secret by claiming executive privilege.\n\nPart of the current administration’s resistance to openness may stem from Trump’s background running a family business.\n\n“If you come out of the private company background and you didn’t have to report to anybody, you basically got to run your own shop and you can just fire people. That’s been Donald Trump’s life,” said Richard Painter, who served as George W. Bush’s White House ethics lawyer. “Then at age 70, suddenly he’s in a job where he’s accountable to other people; there’s a Constitution and a set of rules here.”", "collection_date": "Sun Sep 17 18:01:10 2017", "converted_collection_date": "09-17-2017 18:01:10" },
{ "newsId": 5718388162, "url": "http://www.dailybreeze.com/2017/09/26/as-senators-defect-gop-concedes-health-bills-fate-bleak/", "summary": "WASHINGTON — Republican Sen. Susan Collins’ decision to oppose the GOP push to repeal President Barack Obama’s health care overhaul leaves the effort all but dead, with even party leaders conceding that their prospects are dismal.\n3 GOP Senate leader, said Monday, after Collins joined a small but pivotal cluster of Republicans saying they’re against the measure.\nTo resuscitate their push, Republicans would need to change opposing senators’ minds, which they’ve tried unsuccessfully to do for months.\nCollins told reporters that she made her decision despite a phone call from Trump, who’s been futilely trying to press unhappy GOP senators to back the measure.\nIt would end Obama’s Medicaid expansion and subsidies for consumers and ship the money — $1.2 trillion through 2026 — to states to use on health services with few constraints.", "author": [ "Associated Press" ], "src": "http://www.dailybreeze.com/", "title": "As senators defect, GOP concedes health bill’s fate bleak – Daily Breeze", "keywords": [ "senate", "fate", "defect", "bleak", "bill", "republicans", "obamas", "concedes", "gop", "measure", "republican", "daily", "bills", "health", "medicaid", "breeze", "senators", "trump", "sen" ], "publish_date": "2017-09-26 00:00:00", "news": "WASHINGTON — Republican Sen. Susan Collins’ decision to oppose the GOP push to repeal President Barack Obama’s health care overhaul leaves the effort all but dead, with even party leaders conceding that their prospects are dismal.\n\n“It’s going to be a heavy lift,” South Dakota Sen. John Thune, the No. 3 GOP Senate leader, said Monday, after Collins joined a small but pivotal cluster of Republicans saying they’re against the measure. He called the prospects “bleak.”\n\n“We don’t have the support for it,” said Sen. Orrin Hatch, R-Utah.\n\nThe collapse marks a replay of the embarrassing loss President Donald Trump and party leaders suffered in July, when the Senate rejected three attempts to pass legislation erasing Obama’s 2010 statute. The GOP has made promises to scrap the law a high-profile vow for years, and its failure to deliver despite controlling the White House and Congress has infuriated conservatives whose votes Republican candidates need.\n\nTo resuscitate their push, Republicans would need to change opposing senators’ minds, which they’ve tried unsuccessfully to do for months. Collins told reporters that she made her decision despite a phone call from Trump, who’s been futilely trying to press unhappy GOP senators to back the measure.\n\nBarring a reversal, Senate Majority Leader Mitch McConnell, R-Ky., must decide whether to hold a roll call at all.\n\nThree GOP “no” votes would doom the bill. GOP Sens. John McCain of Arizona, Rand Paul of Kentucky and Texas’ Ted Cruz have said they oppose the measure, though Cruz aides said he was seeking changes that would let him vote yes.\n\nSen. Lisa Murkowski, R-Alaska, remains undecided. Murkowski, who voted against the failed GOP bills in July, has said she’s analyzing the measure’s impact on her state, where medical costs are high.\n\nThis was the last week Republicans had any chance of prevailing with their narrow 52-48 Senate margin. Next Sunday, protections expire against a Democratic filibuster, bill-killing delays that Republicans lack the votes to overcome.\n\nRepublicans had pinned their last hopes on a measure by GOP Sens. Bill Cassidy of Louisiana and South Carolina’s Lindsey Graham. It would end Obama’s Medicaid expansion and subsidies for consumers and ship the money — $1.2 trillion through 2026 — to states to use on health services with few constraints.\n\nCollins announced her decision shortly after the nonpartisan Congressional Budget Office said “millions” of Americans would lose coverage under the bill and projected it would impose $1 trillion in Medicaid cuts through 2026.\n\nThe Maine moderate said in a statement that the legislation would make “devastating” cuts in the Medicaid program for poor and disabled people, drive up premiums for millions and weaken protections Obama’s law gives people with pre-existing medical conditions. She said the legislation is “deeply flawed,” despite eleventh-hour changes its sponsors have made in search of support.\n\nDesperate to win over reluctant senators, GOP leaders revised the measure several times, adding money late Sunday for Alaska, Arizona, Maine, Kentucky and Texas in a clear pitch for Republican holdouts. They also gave states the ability — without federal permission — to permit insurers to charge people with serious illnesses higher premiums and to sell low-premium policies with big coverage gaps and high deductibles.\n\nLoud protesters forced the Senate Finance Committee to briefly delay the chamber’s first and only hearing on the charged issue. Police lugged some demonstrators out of the hearing room and trundled out others in wheelchairs as scores chanted, “No cuts to Medicaid, save our liberty.”\n\nOn Monday, Trump took on McCain, who’d returned to the Senate after a brain cancer diagnosis in July to cast the key vote that wrecked this summer’s effort. Trump called that “a tremendous slap in the face of the Republican Party” in a call to the “Rick & Bubba Show,” an Alabama-based talk radio program.\n\nCassidy and Graham defended their bill before the Finance committee.\n\n“I don’t need a lecture from anybody about health care,” Graham told the panel’s Democrats. Referring to Obama’s overhaul, he added, “What you have created isn’t working.”\n\nAlso testifying was Sen. Mazie Hirono, D-Hawaii, who learned earlier this year that she has kidney cancer.\n\nShe said colleagues and others have helped her battle the disease with compassion, saying, “Sadly, this is not in this bill.”\n\nAssociated Press Washington bureau chief Julie Pace, and writers Andrew Taylor, Richard Lardner, Laurie Kellman, Ken Thomas and Erica Werner contributed to this report.", "collection_date": "Wed Sep 27 11:02:34 2017", "converted_collection_date": "09-27-2017 11:02:34" },
{ "newsId": 5718483236, "url": "http://www.dailybulletin.com/2017/09/17/shadows-of-secrecy-begin-to-spread-across-federal-government-6/", "summary": "Still, a new slate of top aides, including White House Chief of Staff John Kelly and presidential spokeswoman Sarah Huckabee Sanders, seems to have opened pinpricks of light and lowered the temperature in the daily White House briefing.\nBut there’s a far longer record of the Trump administration’s secrecy, despite Trump’s campaign vow to “drain the swamp” of Washington.\nAsked what the Trump administration is doing to foster openness in government, a White House spokeswoman did not respond.\nTrump’s core supporters seem to be OK with this, he said, “as if new degrees of federal government secrecy are actually better for the country.”It’s not just the White House.\nThat’s been Donald Trump’s life,” said Richard Painter, who served as George W. Bush’s White House ethics lawyer.", "author": [ "The Associated Press" ], "src": "http://www.dailybulletin.com/", "title": "Shadows of secrecy begin to spread across federal government", "keywords": [ "federal", "house", "records", "spread", "begin", "shadows", "administration", "trumps", "requests", "president", "trump", "white", "secrecy" ], "publish_date": "2017-09-17 00:00:00", "news": "By LAURIE KELLMAN, Associated Press\n\nWASHINGTON >> There are cracks in the curtains President Donald Trump tried to draw around the government early in his presidency, but the slivers of light aren’t making it easier to hold federal officials accountable for their actions.\n\nTrump still refuses to divest from his real estate and hotel empire or release virtually any of his tax returns. His administration is vigorously pursuing whistleblowers. Among scores of vacant senior jobs in the government is an inspector general for the Department of Energy — led by Secretary Rick Perry, former governor of Texas — as it helps drive the region’s recovery from Hurricane Harvey.\n\nRebuilding from the deadly storm seems certain to be a $100 billion-plus endeavor involving multiple federal departments and an army of government contractors. If the ghosts of Katrina, Sandy and other big storms are guides, the bonanza of taxpayer dollars is a recipe for corruption. And that makes transparency and accountability all the more critical for a president who has bristled at the suggestion of either one.\n\n• Related Story: Across US, lawmakers chip away at public’s access to records\n\n“This is an administration that wants to do things their own way and a president that wants to do things his own way,” said Rick Blum, director of News Media for Open Government, of which The Associated Press is a member. “(Trump) is frustrated by the institutions our founders established. And he’s going to have to learn that the public deserves a free and independent press.”\n\nTo be sure, Trump has not backed off his fury with the media or his branding of reporters as “enemies of the people” who want to harm the country. He still calls revelations he doesn’t like “fake news.” And he tweets untruths himself, including that he witnessed Harvey’s devastation “first hand” during his first visit to Texas on the edges of the disaster zone.\n\nStill, a new slate of top aides, including White House Chief of Staff John Kelly and presidential spokeswoman Sarah Huckabee Sanders, seems to have opened pinpricks of light and lowered the temperature in the daily White House briefing.\n\nTrump has let fade his threat to scrap the daily question-and-answer sessions in favor of written questions and responses since the dismissals of Reince Priebus, Sean Spicer and Steve Bannon from his inner circle. Education Secretary Betsy DeVos gave the AP an interview about education policy.\n\nBut there’s a far longer record of the Trump administration’s secrecy, despite Trump’s campaign vow to “drain the swamp” of Washington.\n\nHis administration has served notice that the executive branch could ignore some information requests from Congress with a few exceptions.\n\n• Related Story: New government secrecy tactic: Suing people who seek public records\n\n“Nonsense,” said Judiciary Committee Chairman Chuck Grassley, an outspoken advocate of open government. “Shutting down oversight requests doesn’t drain the swamp, Mr. President. It floods the swamp.”\n\nMembers of the administration have resisted being questioned. Some White House briefings were declared off-limits for video or audio. And in July, during the president’s second overseas trip, the administration insisted that a briefing by Secretary of State Rex Tillerson on Trump’s meeting with Russian President Vladimir Putin be off-camera. Trump also barred the U.S. media from his White House meeting with Russian officials, only to see photos of the Oval Office session surface in the Russian media.\n\nThe signs of struggle included the resignation in July of the government’s ethics chief, Walter Shaub, after an extraordinary public fight with Trump’s lawyers over potential conflicts of interest. Shaub, an Obama appointee leaving short of the end of his five-year term, had tried unsuccessfully to get Trump to fully divest from his business empire.\n\nAs with most new administrations, Trump’s Justice Department has not issued its own its official policy on complying with one of the cornerstones of open government, the federal Freedom of Information Act. Asked what the Trump administration is doing to foster openness in government, a White House spokeswoman did not respond.\n\n“Trump and his closest aides appear to have little respect for the very processes of government, and therefore little appreciation of the public’s need to know of them as part of our democratic process,” said Daniel J. Metcalfe, the founding director of the Justice Department’s Office of Information and Privacy who teaches secrecy law at American University.\n\nTrump’s core supporters seem to be OK with this, he said, “as if new degrees of federal government secrecy are actually better for the country.”\n\nIt’s not just the White House.\n\nProceedings of the House and Senate are televised live, as are many congressional hearings. But Senate leaders this year briefly tried to bar reporters from conducting televised hallway interviews without permission. And Senate Majority leader Mitch McConnell opted to privately negotiate an ultimately unsuccessful bill to overhaul Obama’s Affordable Care Act. Closing the beginning of the bill-writing process is unusual, though when the original bill was passed, negotiators closed it at the end, to get a final deal.\n\nThe Obama administration in its final year spent a record $36.2 million on legal costs defending its refusal to turn over federal records under FOIA, an Associated Press analysis showed earlier this year. The Obama administration also set records for outright denial of access to files, refusing to quickly consider requests described as especially newsworthy, for example.\n\nBut Obama signed two executive orders and a set of memoranda on his first day in office that directed the government to revert toward openness. One directive reversed policy by President George W. Bush that made it easier for government agencies to deny Freedom of Information Act requests for records. Another effectively repealed a Bush executive order that allowed former presidents or their heirs to keep records secret by claiming executive privilege.\n\nPart of the current administration’s resistance to openness may stem from Trump’s background running a family business.\n\n“If you come out of the private company background and you didn’t have to report to anybody, you basically got to run your own shop and you can just fire people. That’s been Donald Trump’s life,” said Richard Painter, who served as George W. Bush’s White House ethics lawyer. “Then at age 70, suddenly he’s in a job where he’s accountable to other people; there’s a Constitution and a set of rules here.”", "collection_date": "Sun Sep 17 19:02:04 2017", "converted_collection_date": "09-17-2017 19:02:04" },
{ "newsId": 5718388806, "url": "http://www.dailybreeze.com/2017/09/27/trump-tweets-hes-still-optimistic-on-health-overhaul/", "summary": "Trump made the remarks a day after Senate GOP leaders discarded their drive to repeal President Barack Obama’s health care overhaul.\n“We have the votes for health care.\nCongress could theoretically vote to renew the health care bill’s 50-vote protection next year.\nBut GOP leaders are talking about first using that protection for their current top priority, tax cuts, not health care.\n2 Senate Democratic leader, Richard Durbin of Illinois, said the White House has yet to approach Democrats with a health care compromise and said he didn’t see what one might look like.", "author": [ "The Associated Press" ], "src": "http://www.dailybreeze.com/", "title": "Trump says GOP has health care votes … but it doesn’t", "keywords": [ "health", "sen", "doesnt", "republicans", "gop", "thats", "vote", "votes", "bill", "trump", "care", "senate" ], "news": "By ALAN FRAM\n\nWASHINGTON — Guess what? Turns out Republicans have the votes to push health care Related Articles Finnish children’s choir to perform free concert at Pasadena Presbyterian Church legislation through the Senate, but they’ve been flummoxed because one supportive senator is in the hospital.\n\nThat was President Donald Trump’s view of where things stand Wednesday on Capitol Hill. And it’s not true.\n\nTrump made the remarks a day after Senate GOP leaders discarded their drive to repeal President Barack Obama’s health care overhaul. They lacked the votes to succeed, a not-so-minor snag that hadn’t changed.\n\nThe three GOP senators whose opposition sunk the Republican measure all remained against it, aides confirmed. That was Arizona’s John McCain, Kentucky’s Rand Paul and Maine’s Susan Collins.\n\nOn Twitter, Trump cited “very positive signs” from GOP Alaska Sen. Lisa Murkowski and “two others.” He added: “we have the HCare Vote, but not for Friday!”\n\nMurkowski never took a position on the bill, which was written quickly with little perusal by senators. She criticized the “lousy process” and said “substance matters.”\n\nNo top Republicans were talking about returning to the matter until they get the 50 votes they’d need to succeed, a tie Vice President Mike Pence would break.\n\nSouth Dakota Sen. John Thune, the chamber’s No. 3 GOP leader, said if the bill’s sponsors “get to where they can get 50 votes or something, my guess is we’ll be coming back to it. That’s a big if.”\n\n“That’s probably a question for a little bit down the road,” said Sen. Bill Cassidy, R-La., a sponsor of the last failed bill, when asked when the push would be revisited. “We have to reassess and regroup.”\n\nTrump saw things differently.\n\n“We have the votes for health care. We have one senator that’s in the hospital. He can’t vote because he’s in the hospital,” he told reporters.\n\nWhite House aides later said the hospitalized lawmaker Trump was talking about was Sen. Thad Cochran, R-Miss., who turns 80 in December.\n\nThat came as news to Cochran.\n\n“Thanks for the well-wishes,” he tweeted. “I’m not hospitalized, but am recuperating at home in Mississippi and look forward to returning to work soon.”\n\nCochran’s aides said he was being treated for a urological issue and could return to Washington if a vote was planned.\n\nTrump later said the senator was “home recovering.”\n\nThe withdrawn bill, which Cassidy sponsored with Sen. Lindsey Graham, R-S.C., would collapse much of Obama’s law into block grants states would receive to shape their own programs.\n\nTrump offered two pathways to success that seem far-fetched and mutually exclusive.\n\nFirst, he said Republicans would have the votes to succeed early next year. But starting this Sunday, Republicans controlling the Senate 52-48 and will no longer be able to win with just 50 votes. They’d need 60 votes, an impossibility thanks to unbroken Democratic opposition to repealing one of their party’s proudest achievements.\n\n“They could try it again and again because they’re going to fail again and again,” Senate Minority Leader Chuck Schumer, D-N.Y., said in a brief interview.\n\nCongress could theoretically vote to renew the health care bill’s 50-vote protection next year. But GOP leaders are talking about first using that protection for their current top priority, tax cuts, not health care. And it’s unclear Republicans are eager to revisit the issue in an election year.\n\nTrump also said he’d talk to Democrats “and I will see if I can get a health care plan that is even better.”\n\nBut there is no clear compromise between a GOP that’s made scrapping Obama’s law a guiding light for seven years and Democrats steadfast on protecting it.\n\nThe No. 2 Senate Democratic leader, Richard Durbin of Illinois, said the White House has yet to approach Democrats with a health care compromise and said he didn’t see what one might look like.\n\n“Block grants to the states with inadequate funding?” Durbin said of the abandoned bill. “Cutbacks in Medicaid? Reductions in health insurance? Those are not good starting points for a bipartisan discussion.”\n\nTrump said he was working on executive orders letting people buy health insurance across state lines and making it easier for them to join association health plans. Such plans let groups of people purchase insurance together for lower prices than individuals.\n\nDemocrats are wary of such ideas, worried they might expose customers with lesser coverage.\n\n“I have to see it, but it could be a race to the bottom. Did he say anything about consumer protection, because that’s the question,” said Sen. Ron Wyden, D-Ore.\n\n___\n\nAssociated Press writer Catherine Lucey contributed.", "collection_date": "Wed Sep 27 21:01:33 2017", "publish_date": "2017-09-27 00:00:00", "converted_collection_date": "09-27-2017 21:01:33" },
{ "newsId": 5718399946, "url": "http://www.dailybreeze.com/2017/10/10/trump-lashes-liddle-bob-corker-as-senators-call-for-calm/", "summary": "Fellow GOP senators, treading carefully, avoided siding with Trump or Corker.\nAnd Corker also figures to be a key player if Trump moves as expected to unwind the Iran nuclear deal.\nThe new free-agent status of Sen. Bob Corker, R-Tenn., should make President Donald Trump and the GOP very nervous.\n(AP Photo/Erik Schelzig, File)President Donald Trump has attacked Sen. Corker on Twitter on numerous occasions.\nThe Senate’s failure on health care has also led Trump to attack Senate Majority Leader Mitch McConnell in the past.", "author": [ "The Associated Press" ], "src": "http://www.dailybreeze.com/", "title": "Trump lashes ‘Liddle Bob Corker’ as senators call for calm", "keywords": [ "bob", "senate", "think", "calm", "corker", "interview", "republican", "trump", "liddle", "senators", "president", "ap", "gop", "lashes", "sen" ], "publish_date": "2017-10-10 00:00:00", "news": "By ERICA WERNER\n\nAP Congressional Correspondent\n\nWASHINGTON — President Donald Trump lashed out at Sen. Bob Corker as “Liddle’ Bob Corker” on Tuesday, continuing a feud with the Tennessee Republican who’s dubbed the White House an “adult day care center” and charged that Trump could be setting the nation on the path toward World War III.\n\nFellow GOP senators, treading carefully, avoided siding with Trump or Corker. But leading lawmakers called on both men to end a quarrel that could imperil the Republican agenda on Capitol Hill. Trump will need Corker if he is to get big tax changes through the Senate, where the narrow GOP majority was unable to repeal Barack Obama’s Affordable Care Act. And Corker also figures to be a key player if Trump moves as expected to unwind the Iran nuclear deal.\n\nThe new free-agent status of Sen. Bob Corker, R-Tenn., should make President Donald Trump and the GOP very nervous. (AP Photo/Erik Schelzig, File)\n\nPresident Donald Trump has attacked Sen. Corker on Twitter on numerous occasions. (AP Photo/Carolyn Kaster)\n\nCorker is hardly the only Republican lambasting President Donald Trump and raising dark concerns about harm the president might cause the U.S. and the world. (AP Photo/J. Scott Applewhite, File)\n\nSen. John Barrasso, R-Wyo., disagrees with Corker, according to his office. (AP Photo/J. Scott Applewhite, File)\n\nRep. Mark Meadows, R-N.C., criticized Corker, saying he finds “those type of comments to not be appropriate especially coming from the chairman of the Foreign Relations committee, and certainly not in keeping with what I know of the way that things are conducted in the West Wing, having been there multiple times.” (AP Photo/J. Scott Applewhite, File)\n\nSenate Majority Leader Mitch McConnell of Ky., who has also been the target of Trump’s attacks after the Senate’s failure to pass health care legislation, didn’t directly answer when asked at an event in Hazard, Kentucky, whether he shared Corker’s sentiments. (AP Photo/Adam Beam)\n\nSen. Steve Daines, R-Mont., “has confidence in the president,” his office said. (AP Photo/J. Scott Applewhite, File)\n\n“I have a lot of respect for Sen. Corker and what he brings to the Senate, but I think the president is leading in the right direction and I’m supportive of what he’s doing,” Sen. Roy Blunt of Missouri, a member of the GOP leadership, told reporters Tuesday. “I would encourage them both to stop what they’re doing and get focused on what we need to be doing.”\n\nBlunt’s comments followed a plea from GOP Sen. Chuck Grassley at a town hall meeting in Jefferson, Iowa, on Monday for Trump and Corker to “cool it.”\n\n“And I think it would help if the president would be the first to cool it,” Grassley said. “I think it would be better if we stuck to the issues and leave personalities out of it.”\n\nTrump’s tweet Tuesday alleged that Corker was “set up” by “the failing” New York Times in a recorded interview Sunday. Corker, who is not running for re-election, leveled searing criticism at Trump and said his conduct “would have to concern anyone who cares about our nation.”\n\nIn the interview, Corker said Trump could set the U.S. “on the path to World War III” with threats toward other countries.\n\nTrump responded to that charge Tuesday as he addressed reporters in the Oval Office while meeting with Henry Kissinger.\n\n“We were on the wrong path before,” Trump said. “All you have to do is take a look. If you look over the last 25 years, through numerous administrations, we were on a path to a very big problem, a problem like this world has never seen. We’re on the right path right now, believe me.”\n\nTrump also disputed the suggestion that his spat with Corker would affect his efforts to pass tax reform.\n\n“I don’t think so, no, I don’t think so at all,” he said in response to a reporter’s question. “I think we’re well in our way.”\n\nEarlier, Trump took to Twitter to voice his grievances over Corker’s New York Times interview, writing that Corker “was made to sound a fool, and that’s what I am dealing with!” Corker’s office declined to respond but a Times spokeswoman, Danielle Rhoades Ha, said “the interview with Senator Corker was on the record and he knew it was being recorded.”\n\nCorker’s comments echoed what some Republicans say privately. But Trump’s enduring popularity with a segment of the GOP base serves as a political muzzle that keeps most elected Republicans from saying anything similar, even those who believe it to be true.\n\nAnd Trump still has plenty of loyalists on Capitol Hill, several of whom voiced displeasure with Corker’s remarks. Corker’s fellow Tennessean, Rep. Diane Black, said in an interview on the Hugh Hewitt Show on Tuesday that “if you talk about an adult daycare center, I’m sorry, but I think the Senate is an adult daycare center. They can’t get anything done over there.”\n\n“We have been waiting for repeal and replace,” Black said, referring to the Senate’s failure to pass legislation to undo the Affordable Care Act after the House passed its own version. The Senate’s failure on health care has also led Trump to attack Senate Majority Leader Mitch McConnell in the past.\n\nMcConnell responded Monday to the Corker-Trump contretemps by saying “Sen. Corker is a valuable member of the Senate Republican caucus and he’s also on the Budget Committee and a particularly important player as we move to the floor on the budget next week.”\n\nHis comments underscored what has frustrated Republicans most about the Trump-Corker feud, which burst open Sunday when Trump began tweeting, inaccurately, that Corker had begged for his endorsement and decided not to run for re-election when Trump turned him down.\n\nFormer top Trump adviser Steve Bannon lashed out at Corker, McConnell and others in an interview with conservative host Sean Hannity late Monday, calling on Corker to resign and threatening to take out incumbent GOP senators in primaries.\n\n“We are declaring war on the Republican establishment,” Bannon said on Fox News.\n\n“Sen. Corker is an absolute disgrace,” he said. “If Bob Corker has any honor, any decency, he should resign immediately.”\n\nAssociated Press writers Adam Beam in Hazard, Kentucky, and Bob Christie in Scottsdale, Arizona, contributed to this report. Jill Colvin, Marcy Gordon, Kevin Freking, Alan Fram, Andrew Taylor and Matthew Daly contributed from Washington.", "collection_date": "Tue Oct 10 20:01:50 2017", "converted_collection_date": "10-10-2017 20:01:50" }
]